/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл Menu_leds.c: Функции-обработчики меню - светодиоды
 *
 *============================================================================================*/

#include <Menu.h>
#include <Menu_items.h>
#include <leds.h>
#include <lcd.h>
#include <text.h>
#include <joystick.h>


void LightsOnFunc(void) {
  u32 tck, tck_led;

  /* Выводим подсказку на экран и ждем key up */
  LCD_CLS();
  CurrentMethod = MET_AND;
  CurrentFont = &Font_6x8;
  LCD_PUTS(0, 0,                       "    Для  возврата   ");
  LCD_PUTS(0, CurrentFont->Height + 2, "     нажмите SEL    ");
  WAIT_UNTIL_KEY_RELEASED(SEL);

  /* Запускаем "спецэффект" */
  CurrentLights = __SHLC(0xFDF05380, LED0_OFS);
  for (tck = 0, tck_led = 0; !KEY_PRESSED(SEL); tck++) {
    if (tck == tck_led) {
      tck_led += 35000;
      ShiftLights();
    }
  }
  /* Нажата SEL - выключаем светодиоды и возвращаемся в главное меню */
  CurrentLights = 0x0;
  ShiftLights();
  DisplayMenu();
}

/*============================================================================================
 * Конец файла Menu_leds.c
 *============================================================================================*/

