/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл font_defs.h: Описание экранных шрифтов
 *
 *============================================================================================*/

#ifndef __FONT_DEFS_H
#define __FONT_DEFS_H

#include <types.h>

/*--------------------------------------------------------------------------------------------*/
/* Структура описания шрифта.                                                                 */

typedef struct tag_FONT {
  u32  Height;        /* Высота символа в пикселях. */
  u32  Width;         /* Ширина символа в пикселях. */
  u32  Count;         /* Число символов в шрифте минус один. */
  u8  *pData;         /* Адрес таблицы с описанием символов шрифта. */
} FONT;

/*--------------------------------------------------------------------------------------------*/
/* Шрифты                                                                                     */

extern FONT Font_6x8;           /* 6  х 8  пикселей             */
extern FONT Font_7x10_thin;     /* 7  х 10 пикселей тонкий      */
extern FONT Font_7x10_bold;     /* 7  х 10 пикселей утолщенный  */
extern FONT Font_12x16;         /* 12 х 16 пикселей             */

#endif /* __FONT_DEFS_H */

/*============================================================================================
 * Конец файла font_defs.h
 *============================================================================================*/

