/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл gl.h: Вывод графических примитивов на LCD-экран
 *
 *============================================================================================*/

#ifndef __GL_H
#define __GL_H

#include <types.h>

void LCD_PutPixel(u32 x, u32 y);
void LCD_Line(u32 x1, u32 y1, u32 x2, u32 y2);
void LCD_Circle(u32 xc, u32 yc, u32 r);

#endif /* __GL_H */

/*============================================================================================
 * Конец файла gl.h
 *============================================================================================*/

