/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл joystick.h: Работа с набором кнопок ("джойстиком")
 *
 *============================================================================================*/

#ifndef __JOYSTICK_H
#define __JOYSTICK_H

#include <types.h>

/* "Коды клавиш" */
typedef enum {
    NOKEY      = 0,
    SEL        = 1,
    RIGHT      = 2,
    LEFT       = 3,
    UP         = 4,
    DOWN       = 5,
    MULTIPLE   = 6,
    NUM_KEY_CODES
} KeyCode;

void InitPortJoystick(void);

/* Определение "кода" по нажатым кнопкам */
KeyCode GetKey(void);

#define KEY_PRESSED(x)              (GetKey() == x)
#define WAIT_UNTIL_KEY_PRESSED(x)   while(!KEY_PRESSED(x)){}
#define WAIT_UNTIL_KEY_RELEASED(x)  while(KEY_PRESSED(x)){}
#define WAIT_UNTIL_ANY_KEY          while(GetKey() == NOKEY){}

#endif /* __JOYSTICK_H */

/*============================================================================================
 * Конец файла joystick.h
 *============================================================================================*/


