/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл Menu_items.h: Функции-обработчики меню
 *
 *============================================================================================*/

#ifndef __MENU_ITEMS_H
#define __MENU_ITEMS_H

/* Графика - Menu_gl.c */
void ElementsFunc(void);
void IndicatorsFunc(void);

/* Светодиоды - Menu_leds.c */
void LightsOnFunc(void);

/* Текст - Menu_text.c */
void FontFunc(void);
void StyleFunc(void);
void ShiftFunc(void);
void BookFunc(void);
void AboutFunc(void);


/* Текст - Menu_technology.c */
void LDM(void);
void MILAND(void);
void MELT(void);
void PHYTON(void);


#endif /* __MENU_ITEMS_H */

/*============================================================================================
 * Конец файла Menu_items.h
 *============================================================================================*/

