/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл systick.h: Утилиты нижнего уровня для работы с системным таймером
 *
 *============================================================================================*/

#ifndef __SYSTICK_H
#define __SYSTICK_H

#include <types.h>

/* Управление системным таймером */
void SysTickStart(u32 ticks);
void SysTickStop();

/* Функция задержки (на базе systick) */
void SysTickDelay(u32 val);

#endif /* __SYSTICK_H */

/*============================================================================================
 * Конец файла systick.h
 *============================================================================================*/

