/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл leds.h: Работа со светодиодами
 *
 *============================================================================================*/

#ifndef __LEDS_H
#define __LEDS_H

#include <types.h>

/* Смещения в регистре и маски для конкретных светодиодов */
typedef enum {
    LED0_OFS    = 0,
    LED1_OFS    = 1,
    LED2_OFS    = 2,
    LED3_OFS    = 3,
    //LED4_OFS    = 14,
    LED0_MASK   = (1 << LED0_OFS),
    LED1_MASK   = (1 << LED1_OFS),
    LED2_MASK   = (1 << LED2_OFS),
    LED3_MASK   = (1 << LED3_OFS),
    //LED4_MASK   = (1 << LED4_OFS),
    LEDS_MASK   = (LED0_MASK | LED1_MASK | LED2_MASK | LED3_MASK)// | LED4_MASK)
} LEDS_Masks;

/* ROL */
#define __SHLC(val, cnt) ((val << (cnt & 31)) | (val >> ((32 - cnt) & 31)))

/* Маска включенных светодиодов */
extern u32 CurrentLights;

/* Сервисные утилиты */
void InitPortLED(void);
void ShiftLights(void);

#endif /* __LEDS_H */

/*============================================================================================
 * Конец файла leds.h
 *============================================================================================*/

