/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл Menu.h: Иерархическое текстовое меню
 *
 *============================================================================================*/

#ifndef __MENU_H
#define __MENU_H

#include <types.h>

#define  MAX_MENU_LEVELS 2

#define countof(a) (sizeof(a) / sizeof(*(a)))

void Menu_Init(void);
void DisplayMenuTitle(u8 *ptr);
void DisplayMenu(void);
/* Ждет нажатия SEL и возвращаемся в главное меню */
void BackToMenuOnSel(void);
/* Функция-диспетчер */
void ReadKey(void);

#endif/* __MENU_H */

/*============================================================================================
 * Конец файла Menu.h
 *============================================================================================*/

