/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл text.h: Вывод символов и текста на экран
 *
 *============================================================================================*/

#ifndef __TEXT_H
#define __TEXT_H

#include <font_defs.h>

/* Стили */
typedef enum {
    StyleSimple,
    StyleBlink,
    StyleFlipFlop,
    StyleVibratory
} TextStyle;

/* Выбранный шрифт для отрисовки текста */
extern FONT *CurrentFont;

/* Вывод байта на экран */
void LCD_PUT_BYTE(u8 x, u8 y, u8 data);
/* Вывод символов и строк текущим шрифтом */
void LCD_PUTC(u8 x, u8 y, u8 ch);
void LCD_PUTS(u8 x, u8 y, uc8* str);
void LCD_PUTS_Ex(u8 x, u8 y, uc8* str, u8 style);

/* Макрокоманда вычисления начала размещения описания символа в таблице описания символов.              */
/* Принимает код символа, адрес структуры описания шрифта. Возвращает адрес начала описания символа.    */
#define Get_Char_Data_Addr(ch)    \
  (CurrentFont)->pData + (ch) * (CurrentFont)->Width * ((((CurrentFont)->Height % 8) != 0) ? (1 + (CurrentFont)->Height / 8) : ((CurrentFont)->Height / 8))

#endif /*__TEXT_H*/

/*============================================================================================
 * Конец файла text.h
 *============================================================================================*/

