/*============================================================================================
 *
 *  (C) 2013, LDM-SYSTEMS
 *
 *  Демонстрационный проект для отладочной платы LDM-K1986BE92QI
 *
 *  Данное ПО предоставляется "КАК ЕСТЬ", т.е. исключительно как пример, призванный облегчить
 *  пользователям разработку их приложений для процессоров Milandr K1986BE92QI. Компания LDM-SYSTEMS
 *  не несет никакой ответственности за возможные последствия использования данного, или
 *  разработанного пользователем на его основе, ПО.
 *
 *--------------------------------------------------------------------------------------------
 *
 *  Файл leds.c: Работа со светодиодами
 *
 *============================================================================================*/

#include <leds.h>
#include <lcd.h>
#include <text.h>
#include <joystick.h>
#include <menu.h>

/* Маска включенных светодиодов */
u32 CurrentLights;

/* Сервисные утилиты */

void InitPortLED(void) {
    PORTB->FUNC &= ~((0xFF << (LED0_OFS << 1)));   /* Port */
    PORTB->ANALOG |= LEDS_MASK;                    /* Digital */
    PORTB->PWR |= (0b10101010 << (LED0_OFS << 1));       /* Slow */
    PORTB->RXTX &= ~LEDS_MASK;
    PORTB->OE |= LEDS_MASK;
}

void ShiftLights(void) {
    u32 ovf;
    PORTB->RXTX = (PORTB->RXTX & ~LEDS_MASK) | (CurrentLights & LEDS_MASK);
    ovf = (CurrentLights & (1UL << 31)) != 0;
    CurrentLights <<= 1;
    CurrentLights |= ovf;
}

/*============================================================================================
 * Конец файла leds.c
 *============================================================================================*/

